import pytest


@pytest.fixture
def transactions_dataframe() -> dict:
    """
    Фикстура, возвращающая DataFrame корректной структуры.
    Строки из operations.xlsx: 2, 20, 40, 60, 80.
    """
    return {
        "Дата операции": [
            "31.12.2021 16:44:00",
            "28.12.2021 18:24:24",
            "25.12.2021 15:30:02",
            "22.12.2021 22:59:48",
            "19.12.2021 18:38:09"
        ],
        "Дата платежа": [
            "31.12.2021",
            "28.12.2021",
            "25.12.2021",
            "23.12.2021",
            "19.12.2021"
        ],
        "Номер карты": [
            "*7197",
            "*5091",
            "*7197",
            "*5091",
            ""
        ],
        "Статус": [
            "OK",
            "OK",
            "OK",
            "OK",
            "OK"
        ],
        "Сумма операции": [
            "-160.89",
            "-210",
            "-5.70",
            "-50",
            "-186"
        ],
        "Валюта операции": [
            "RUB",
            "RUB",
            "RUB",
            "RUB",
            "RUB"
        ],
        "Сумма платежа": [
            "-160.89",
            "-210",
            "-5.70",
            "-50",
            "-186"
        ],
        "Валюта платежа": [
            "RUB",
            "RUB",
            "RUB",
            "RUB",
            "RUB"
        ],
        "Кэшбэк": [
            "",
            "",
            "",
            "",
            ""
        ],
        "Категория": [
            "Супермаркеты",
            "Дом и ремонт",
            "Каршеринг",
            "Каршеринг",
            "Переводы"
        ],
        "MCC": [
            "5411",
            "5200",
            "7512",
            "7512",
            ""
        ],
        "Описание": [
            "Колхоз",
            "Галамарт",
            "Ситидрайв",
            "Ситидрайв",
            "Андрей Х."
        ],
        "Бонусы (включая кэшбэк)": [
            "3",
            "2",
            "0",
            "2",
            "0"
        ],
        "Округление на инвесткопилку": [
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "Сумма операции с округлением": [
            "160.89",
            "210",
            "5.7",
            "50",
            "186"
        ]
    }


@pytest.fixture
def transactions_dataframe_empty() -> dict:
    """
    Фикстура, возвращающая DataFrame без номеров карт.
    """
    return {
        "Дата операции": [
            "31.12.2021 16:44:00",
            "28.12.2021 18:24:24",
            "25.12.2021 15:30:02",
            "22.12.2021 22:59:48",
            "19.12.2021 18:38:09"
        ],
        "Дата платежа": [
            "31.12.2021",
            "28.12.2021",
            "25.12.2021",
            "23.12.2021",
            "19.12.2021"
        ],
        "Номер карты": [
            "",
            "",
            "",
            "",
            ""
        ],
        "Статус": [
            "OK",
            "OK",
            "OK",
            "OK",
            "OK"
        ],
        "Сумма операции": [
            "-160.89",
            "-210",
            "-5.70",
            "-50",
            "-186"
        ],
        "Валюта операции": [
            "RUB",
            "RUB",
            "RUB",
            "RUB",
            "RUB"
        ],
        "Сумма платежа": [
            "-160.89",
            "-210",
            "-5.70",
            "-50",
            "-186"
        ],
        "Валюта платежа": [
            "RUB",
            "RUB",
            "RUB",
            "RUB",
            "RUB"
        ],
        "Кэшбэк": [
            "",
            "",
            "",
            "",
            ""
        ],
        "Категория": [
            "Супермаркеты",
            "Дом и ремонт",
            "Каршеринг",
            "Каршеринг",
            "Переводы"
        ],
        "MCC": [
            "5411",
            "5200",
            "7512",
            "7512",
            ""
        ],
        "Описание": [
            "Колхоз",
            "Галамарт",
            "Ситидрайв",
            "Ситидрайв",
            "Андрей Х."
        ],
        "Бонусы (включая кэшбэк)": [
            "3",
            "2",
            "0",
            "2",
            "0"
        ],
        "Округление на инвесткопилку": [
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "Сумма операции с округлением": [
            "160.89",
            "210",
            "5.7",
            "50",
            "186"
        ]
    }


@pytest.fixture
def filtered_by_data_transactions_dataframe() -> dict:
    """
    Фикстура, возвращающая DataFrame, отфильтрованный по дате.
    Строки из operations.xlsx: 2, 20, 40, 60, 80.
    """
    return {
        "Дата операции": ["22.12.2021 22:59:48", "19.12.2021 18:38:09"],
        "Дата платежа": ["23.12.2021", "19.12.2021"],
        "Номер карты": ["*5091", ""],
        "Статус": ["OK", "OK"],
        "Сумма операции": ["-50", "-186"],
        "Валюта операции": ["RUB", "RUB"],
        "Сумма платежа": ["-50", "-186"],
        "Валюта платежа": ["RUB", "RUB"],
        "Кэшбэк": ["", ""],
        "Категория": ["Каршеринг", "Переводы"],
        "MCC": ["7512", ""],
        "Описание": ["Ситидрайв", "Андрей Х."],
        "Бонусы (включая кэшбэк)": ["2", "0"],
        "Округление на инвесткопилку": ["0", "0"],
        "Сумма операции с округлением": ["50", "186"]
    }


@pytest.fixture
def dataframe_calculate_spend_and_cashback() -> dict:
    """
    Фикстура, возвращающая DataFrame, сгруппированный по номерам карт,
    подчитывающий сумму всех операций и суммарном кэшбэк по картам.
    """
    return {
        "Номер карты": ["*7197", "*5091"],
        "Сумма платежа": [-166.59, -260.0],
        "Кэшбэк": [0.0, 0.0]
    }


@pytest.fixture
def dataframe_calculate_spend_and_cashback_empty() -> dict:
    """
    Фикстура, возвращающая пустой DataFrame (полученный после группировки DataFrame без номеров карт)
    """
    return {
        "Номер карты": [],
        "Сумма платежа": [],
        "Кэшбэк": []
    }


@pytest.fixture
def transactions_top_five() -> list[dict]:
    """
    Фикстура, возвращающая список из топ-5 транзакций.
    """
    return [
        {'date': '28.12.2021', 'amount': -210.0, 'category': 'Дом и ремонт', 'description': 'Галамарт'},
        {'date': '19.12.2021', 'amount': -186.0, 'category': 'Переводы', 'description': 'Андрей Х.'},
        {'date': '31.12.2021', 'amount': -160.89, 'category': 'Супермаркеты', 'description': 'Колхоз'},
        {'date': '22.12.2021', 'amount': -50.0, 'category': 'Каршеринг', 'description': 'Ситидрайв'},
        {'date': '25.12.2021', 'amount': -5.7, 'category': 'Каршеринг', 'description': 'Ситидрайв'}
    ]
