import pandas as pd
import pytest


@pytest.fixture
def transactions_dataframe() -> dict:
    """
    Фикстура, возвращающая DataFrame корректной структуры.
    Строки из operations.xlsx: 2, 20, 40, 60, 80.
    """
    return {
        "Дата операции": [
            pd.Timestamp("31.12.2021 16:44:00"),
            pd.Timestamp("28.12.2021 18:24:24"),
            pd.Timestamp("25.12.2021 15:30:02"),
            pd.Timestamp("22.12.2021 22:59:48"),
            pd.Timestamp("19.12.2021 18:38:09")
        ],
        "Дата платежа": [
            "31.12.2021",
            "28.12.2021",
            "25.12.2021",
            "23.12.2021",
            "19.12.2021"
        ],
        "Номер карты": [
            "*7197",
            "*5091",
            "*7197",
            "*5091",
            ""
        ],
        "Статус": [
            "OK",
            "OK",
            "OK",
            "OK",
            "OK"
        ],
        "Сумма операции": [
            "-160.89",
            "-210",
            "-5.70",
            "-50",
            "-186"
        ],
        "Валюта операции": [
            "RUB",
            "RUB",
            "RUB",
            "RUB",
            "RUB"
        ],
        "Сумма платежа": [
            "-160.89",
            "-210",
            "-5.70",
            "-50",
            "-186"
        ],
        "Валюта платежа": [
            "RUB",
            "RUB",
            "RUB",
            "RUB",
            "RUB"
        ],
        "Кэшбэк": [
            "",
            "",
            "",
            "",
            ""
        ],
        "Категория": [
            "Супермаркеты",
            "Дом и ремонт",
            "Каршеринг",
            "Каршеринг",
            "Переводы"
        ],
        "MCC": [
            "5411",
            "5200",
            "7512",
            "7512",
            ""
        ],
        "Описание": [
            "Колхоз",
            "Галамарт",
            "Ситидрайв",
            "Ситидрайв",
            "Андрей Х."
        ],
        "Бонусы (включая кэшбэк)": [
            "3",
            "2",
            "0",
            "2",
            "0"
        ],
        "Округление на инвесткопилку": [
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "Сумма операции с округлением": [
            "160.89",
            "210",
            "5.7",
            "50",
            "186"
        ]
    }


@pytest.fixture
def transactions_dataframe_empty() -> dict:
    """ Фикстура, возвращающая DataFrame без номеров карт. """
    return {
        "Дата операции": [
            "31.12.2021 16:44:00",
            "28.12.2021 18:24:24",
            "25.12.2021 15:30:02",
            "22.12.2021 22:59:48",
            "19.12.2021 18:38:09"
        ],
        "Дата платежа": [
            "31.12.2021",
            "28.12.2021",
            "25.12.2021",
            "23.12.2021",
            "19.12.2021"
        ],
        "Номер карты": [
            "",
            "",
            "",
            "",
            ""
        ],
        "Статус": [
            "OK",
            "OK",
            "OK",
            "OK",
            "OK"
        ],
        "Сумма операции": [
            "-160.89",
            "-210",
            "-5.70",
            "-50",
            "-186"
        ],
        "Валюта операции": [
            "RUB",
            "RUB",
            "RUB",
            "RUB",
            "RUB"
        ],
        "Сумма платежа": [
            "-160.89",
            "-210",
            "-5.70",
            "-50",
            "-186"
        ],
        "Валюта платежа": [
            "RUB",
            "RUB",
            "RUB",
            "RUB",
            "RUB"
        ],
        "Кэшбэк": [
            "",
            "",
            "",
            "",
            ""
        ],
        "Категория": [
            "Супермаркеты",
            "Дом и ремонт",
            "Каршеринг",
            "Каршеринг",
            "Переводы"
        ],
        "MCC": [
            "5411",
            "5200",
            "7512",
            "7512",
            ""
        ],
        "Описание": [
            "Колхоз",
            "Галамарт",
            "Ситидрайв",
            "Ситидрайв",
            "Андрей Х."
        ],
        "Бонусы (включая кэшбэк)": [
            "3",
            "2",
            "0",
            "2",
            "0"
        ],
        "Округление на инвесткопилку": [
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "Сумма операции с округлением": [
            "160.89",
            "210",
            "5.7",
            "50",
            "186"
        ]
    }


@pytest.fixture
def filtered_by_data_transactions_dataframe() -> dict:
    """
    Фикстура, возвращающая DataFrame, отфильтрованный по дате.
    Строки из operations.xlsx: 2, 20, 40, 60, 80.
    """
    return {
        "Дата операции": ["22.12.2021 22:59:48", "19.12.2021 18:38:09"],
        "Дата платежа": ["23.12.2021", "19.12.2021"],
        "Номер карты": ["*5091", ""],
        "Статус": ["OK", "OK"],
        "Сумма операции": ["-50", "-186"],
        "Валюта операции": ["RUB", "RUB"],
        "Сумма платежа": ["-50", "-186"],
        "Валюта платежа": ["RUB", "RUB"],
        "Кэшбэк": ["", ""],
        "Категория": ["Каршеринг", "Переводы"],
        "MCC": ["7512", ""],
        "Описание": ["Ситидрайв", "Андрей Х."],
        "Бонусы (включая кэшбэк)": ["2", "0"],
        "Округление на инвесткопилку": ["0", "0"],
        "Сумма операции с округлением": ["50", "186"]
    }


@pytest.fixture
def dataframe_calculate_spent_and_cashback() -> dict:
    """ Фикстура, возвращающая DataFrame, сгруппированный по номерам карт,
    подчитывающий сумму всех операций и суммарном кэшбэк по картам. """
    return {
        "last_digits": ["7197", "5091"],
        "total_spent": [166.59, 260.0],
        "cashback": [0.0, 0.0]
    }


@pytest.fixture
def dataframe_calculate_spent_and_cashback_empty() -> dict:
    """ Фикстура, возвращающая пустой DataFrame (полученный после группировки DataFrame без номеров карт). """
    return {
        "last_digits": [],
        "total_spent": [],
        "cashback": []
    }


@pytest.fixture
def transactions_top_five() -> list[dict]:
    """ Фикстура, возвращающая список из топ-5 транзакций. """
    return [
        {'date': '28.12.2021', 'amount': 210.0, 'category': 'Дом и ремонт', 'description': 'Галамарт'},
        {'date': '19.12.2021', 'amount': 186.0, 'category': 'Переводы', 'description': 'Андрей Х.'},
        {'date': '31.12.2021', 'amount': 160.89, 'category': 'Супермаркеты', 'description': 'Колхоз'},
        {'date': '22.12.2021', 'amount': 50.0, 'category': 'Каршеринг', 'description': 'Ситидрайв'},
        {'date': '25.12.2021', 'amount': 5.7, 'category': 'Каршеринг', 'description': 'Ситидрайв'}
    ]


@pytest.fixture
def currency_response_example() -> dict:
    """ Фикстура, возвращающая пример ответа сервера, конвертирующего валюту. """
    return {
        "date": "2018-02-22",
        "historical": "",
        "info": {
            "rate": 149.0,
            "timestamp": 1000000000
        },
        "query": {
            "amount": 25,
            "from": "USD",
            "to": "RUB"
        },
        "result": 1490.0,
        "success": True
    }


@pytest.fixture
def stocks_response_example() -> dict:
    """ Фикстура, возвращающая пример ответа сервера для нахождения текущего курса акции. """
    return {
        "pagination": {
            "limit": 100,
            "offset": 0,
            "count": 100,
            "total": 9944
        },
        "data": [
            {
                "open": 129.8,
                "high": 133.04,
                "low": 129.47,
                "close": 132.995,
                "volume": 106686703.0,
                "adj_high": 133.04,
                "adj_low": 129.47,
                "adj_close": 132.995,
                "adj_open": 129.8,
                "adj_volume": 106686703.0,
                "split_factor": 1.0,
                "dividend": 0.0,
                "symbol": "AAPL",
                "exchange": "XNAS",
                "date": "2021-04-09T00:00:00+0000"
            }
        ]
    }


@pytest.fixture
def user_currencies_and_stocks() -> dict:
    """ Фикстура, возвращающая пример словаря с тикерами акций и кодами валют пользователя. """
    return {
        "user_currencies": ["USD", "EUR"],
        "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]
    }


@pytest.fixture
def user_stock_rates() -> list:
    """ Фикстура, возвращающая пример списка словарей с тикерами акций и их курсом. """
    return [
        {"stock": "AAPL", "price": 12000.0},
        {"stock": "AMZN", "price": 10000.0},
        {"stock": "GOOGL", "price": 8000.0},
        {"stock": "MSFT", "price": 7000.0},
        {"stock": "TSLA", "price": 5000.0}
    ]
